---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewerReferenceLabelText
source: html/1dc2ade1-c2d8-db53-58ab-a7b8cf6c3a62.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewerReferenceLabelText Property

"Reference Label"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewerReferenceLabelText { get; }
```